# Pandas - tidying data

This notebook illustrates how data can be joined and queried accurately, even if the data is not 'tidy'.  The first step is to tidy it.  This involves resolving issues where :

 - 1 columns contain values, not variables.
 
 - 2 columns contain multiple variables.
 
 - 3 both rows and columns contain variables.
 
 - 4 there are multiple observational units in a table.
 
 - 5 observational units are stored in multiple datasets.
 
 This process will require the use of Pandas functions:
 
  - melt
  - split
  - concat
  - pivot_table
  - drop_duplicates
  - merge
  
  We will also retrieve a set of data files from a URL and save them locally.

### Establish current working directory and set up a path to your data folder.

In [1]:
import os
os.getcwd()

'/Users/callumobrien/GitHub/databases-2/mongo-test-practice'

In [2]:
import pandas as pd
from os.path import join

### CHANGE datapath to wherever you downloaded the datasets

In [3]:
datapath = join('..','..','Datasets')

In [4]:
from os import listdir
# listdir(datapath)

## 1. Columns contain values, not variables

In this example, rather than having separate columns for the different income brackets, we want a single column with income in it. This will make the table bigger, because there will be a row for each religion for each income bracket.  We make what is known as a 'wide' table into a 'long' table.

In [5]:
df = pd.read_csv("UntidyMonthlyUnemployment.csv")

In [6]:
df.head(2)

,Unnamed: 0,Advanced Economies,Argentina,Australia,Austria,Belgium,Bulgaria,Bahrain,Belarus,Brazil,...,Thailand,Tunisia,Turkey,"Taiwan, China",Uruguay,United States,"Venezuela, RB",Vietnam,World (WBG members),South Africa
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1990M01,5.810216,NaN,6.213296,5.306584,6.831543,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,1.5,NaN,5.4,NaN,NaN,NaN,NaN

In [7]:
df.columns

Index(['Unnamed: 0', 'Advanced Economies', 'Argentina', 'Australia', 'Austria',
       'Belgium', 'Bulgaria', 'Bahrain', 'Belarus', 'Brazil', 'Canada',
       'Switzerland', 'Chile', 'China', 'Colombia', 'Cyprus', 'Czech Republic',
       'Germany', 'Denmark', 'Dominican Republic', 'Algeria',
       'EMDE East Asia & Pacific', 'EMDE Europe & Central Asia', 'Ecuador',
       'Egypt, Arab Rep.', 'Emerging Market and Developing Economies (EMDEs)',
       'Spain', 'Estonia', 'Finland', 'France', 'United Kingdom', 'Greece',
       'High Income Countries', 'Hong Kong SAR, China', 'Croatia', 'Hungary',
       'India', 'Ireland', 'Iceland', 'Israel', 'Italy', 'Jordan', 'Japan',
       'Kazakhstan', 'Korea, Rep.', 'EMDE Latin America & Caribbean',
       'Low-Income Countries (LIC)', 'Sri Lanka', 'Lithuania', 'Luxembourg',
       'Latvia', 'Morocco', 'Moldova, Rep.', 'Mexico',
       'Middle-Income Countries (MIC)', 'North Macedonia', 'Malta',
       'EMDE Middle East & N. Africa', 'Netherlands', 'Norway', 'New Zealand',
       'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Romania',
       'Russian Federation', 'EMDE South Asia', 'Saudi Arabia', 'Singapore',
       'EMDE Sub-Saharan Africa', 'Slovakia', 'Slovenia', 'Sweden', 'Thailand',
       'Tunisia', 'Turkey', 'Taiwan, China', 'Uruguay', 'United States',
       'Venezuela, RB', 'Vietnam', 'World (WBG members)', 'South Africa'],
      dtype='object')

# Intervention 1
 What are the columns?

 - 'Unnamed: 0' seems to be the year and month.  This needs to be renamed.

 - Some columns are groups - we can omit them:
    'Advanced.Economies','EMDE.East.Asia...Pacific','EMDE.Europe...Central.Asia','EMDE.Middle.East...N..Africa','EMDE.South.Asia',
    'EMDE.Sub.Saharan.Africa','Emerging.Market.and.Developing.Economies..EMDEs.','High.Income.Countries', 'Middle.Income.Countries..MIC.', 'World..WBG.members.'

In [8]:
unwantedcolumns= ['Advanced Economies',
       'EMDE East Asia & Pacific', 'EMDE Europe & Central Asia',  'Emerging Market and Developing Economies (EMDEs)',
       'High Income Countries',  'Low-Income Countries (LIC)', 'Middle-Income Countries (MIC)',  'EMDE Middle East & N. Africa',
       'EMDE Sub-Saharan Africa',  'World (WBG members)']
# drop the unwanted columns, making sure that you've checked inplace=True:
df.drop(columns=unwantedcolumns, inplace=True)
#Rename the column 'Unnamed: 0' to 'MonYear', again, making sure inplace=True
df.rename(columns={'Unnamed: 0':'MonYear'}, inplace=True)
df.head(2)

,MonYear,Argentina,Australia,Austria,Belgium,Bulgaria,Bahrain,Belarus,Brazil,Canada,...,Sweden,Thailand,Tunisia,Turkey,"Taiwan, China",Uruguay,United States,"Venezuela, RB",Vietnam,South Africa
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1990M01,NaN,6.213296,5.306584,6.831543,NaN,NaN,NaN,NaN,7.9,...,2.182138,NaN,NaN,NaN,1.5,NaN,5.4,NaN,NaN,NaN

In [9]:
#Check the number of unique values in each column
df.nunique()

MonYear          356
Argentina        210
Australia        356
Austria          356
Belgium          355
                ...
Uruguay          102
United States     61
Venezuela, RB    208
Vietnam           11
South Africa     228
Length: 75, dtype: int64

In [10]:
print(df.nunique())

MonYear          356
Argentina        210
Australia        356
Austria          356
Belgium          355
                ...
Uruguay          102
United States     61
Venezuela, RB    208
Vietnam           11
South Africa     228
Length: 75, dtype: int64

In [11]:
df.dropna(how='all',inplace=True)

In [12]:
df.columns

Index(['MonYear', 'Argentina', 'Australia', 'Austria', 'Belgium', 'Bulgaria',
       'Bahrain', 'Belarus', 'Brazil', 'Canada', 'Switzerland', 'Chile',
       'China', 'Colombia', 'Cyprus', 'Czech Republic', 'Germany', 'Denmark',
       'Dominican Republic', 'Algeria', 'Ecuador', 'Egypt, Arab Rep.', 'Spain',
       'Estonia', 'Finland', 'France', 'United Kingdom', 'Greece',
       'Hong Kong SAR, China', 'Croatia', 'Hungary', 'India', 'Ireland',
       'Iceland', 'Israel', 'Italy', 'Jordan', 'Japan', 'Kazakhstan',
       'Korea, Rep.', 'EMDE Latin America & Caribbean', 'Sri Lanka',
       'Lithuania', 'Luxembourg', 'Latvia', 'Morocco', 'Moldova, Rep.',
       'Mexico', 'North Macedonia', 'Malta', 'Netherlands', 'Norway',
       'New Zealand', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Romania', 'Russian Federation', 'EMDE South Asia', 'Saudi Arabia',
       'Singapore', 'Slovakia', 'Slovenia', 'Sweden', 'Thailand', 'Tunisia',
       'Turkey', 'Taiwan, China', 'Uruguay', 'United States', 'Venezuela, RB',
       'Vietnam', 'South Africa'],
      dtype='object')

## The melt function

 - id_vars is a container (it can be a list, tuple or np array) for variables that will remain the same.
 
 - value_vars identifies the columns you want to meld down (or unpivot).  If this is not specified, the default is all columns not in id_vars.
 
 - var_name is then new column name where the value_vars is melted into (default name 'variable').
 
 - value_name is the new column name representing the values for var_name (default name 'value).

# Intervention 2

Fill out the instruction below, providing the dataframe name, the id_vars value and the var_name value

In [13]:
dflong = pd.melt(
    df, id_vars='MonYear', 
    var_name='Country',
    value_name='UnemploymentRate')
dflong

       MonYear       Country  UnemploymentRate
0      1990M01     Argentina               NaN
1      1990M02     Argentina               NaN
2      1990M03     Argentina               NaN
3      1990M04     Argentina               NaN
4      1990M05     Argentina               NaN
...        ...           ...               ...
26339  2019M04  South Africa          28.54231
26340  2019M05  South Africa          28.70605
26341  2019M06  South Africa          28.85622
26342  2019M07  South Africa               NaN
26343  2019M08  South Africa               NaN

[26344 rows x 3 columns]

# Intervention 3 

Split the MonYear column on the 'M'.

In [14]:
#Using df.column.str.split('<string>').str.get(0), extract the year and add it to the dataframe

In [15]:
split = dflong.MonYear.str.split('M')
dflong['Month'] = split.str.get(0)
dflong['Year'] = split.str.get(1)
dflong.head()

   MonYear    Country  UnemploymentRate Month Year
0  1990M01  Argentina               NaN  1990   01
1  1990M02  Argentina               NaN  1990   02
2  1990M03  Argentina               NaN  1990   03
3  1990M04  Argentina               NaN  1990   04
4  1990M05  Argentina               NaN  1990   05

In [16]:
#drop the MonYear column
df.drop(columns='MonYear', inplace=True)

In [17]:
dflong.drop(columns=['MonYear'],inplace=True)
dflong.head(2)

     Country  UnemploymentRate Month Year
0  Argentina               NaN  1990   01
1  Argentina               NaN  1990   02

# Intervention 4 

What values are there for year?

In [18]:
dflong.Year.unique()

array(['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11',
       '12'], dtype=object)

In [19]:
dflong.Month.unique()

array(['1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005',
       '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017', '2018', '2019'], dtype=object)

In [20]:
dflong[dflong['UnemploymentRate'].isna()]

            Country  UnemploymentRate Month Year
0         Argentina               NaN  1990   01
1         Argentina               NaN  1990   02
2         Argentina               NaN  1990   03
3         Argentina               NaN  1990   04
4         Argentina               NaN  1990   05
...             ...               ...   ...  ...
26111  South Africa               NaN  2000   04
26112  South Africa               NaN  2000   05
26113  South Africa               NaN  2000   06
26342  South Africa               NaN  2019   07
26343  South Africa               NaN  2019   08

[7045 rows x 4 columns]

# Intervention 5

Extract just the rows with values in them into dfval. Find if there are any NAs.  Check for unique year and month values.

In [21]:
dfval = dflong[dflong['UnemploymentRate'].notna()]
dfval.head()

       Country  UnemploymentRate Month Year
144  Argentina          23.11113  2002   01
145  Argentina          23.40373  2002   02
146  Argentina          23.43957  2002   03
147  Argentina          23.70204  2002   04
148  Argentina          23.47715  2002   05

In [22]:
dfval[dfval.isna().any(axis=1)]

Empty DataFrame
Columns: [Country, UnemploymentRate, Month, Year]
Index: []

In [23]:
dfval.Year.unique()

array(['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11',
       '12'], dtype=object)

#Column values spread across datasets.

In [24]:
hdf23=pd.read_csv('DataForTable2.1WHR2023.csv')

In [25]:
hdf20=pd.read_csv('WHR20_DataForTable2.1.csv')

## Find which columns are in each

In [26]:
hdf23.columns

Index(['Country name', 'year', 'Life Ladder', 'Log GDP per capita',
       'Social support', 'Healthy life expectancy at birth',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption', 'Positive affect', 'Negative affect'],
      dtype='object')

In [27]:
hdf20.columns

Index(['Country name', 'year', 'Life Ladder', 'Log GDP per capita',
       'Social support', 'Healthy life expectancy at birth',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption', 'Positive affect', 'Negative affect',
       'Confidence in national government', 'Democratic Quality',
       'Delivery Quality', 'Standard deviation of ladder by country-year',
       'Standard deviation/Mean of ladder by country-year',
       'GINI index (World Bank estimate)',
       'GINI index (World Bank estimate), average 2000-2017, unbalanced panel',
       'gini of household income reported in Gallup, by wp5-year',
       'Most people can be trusted, Gallup',
       'Most people can be trusted, WVS round 1981-1984',
       'Most people can be trusted, WVS round 1989-1993',
       'Most people can be trusted, WVS round 1994-1998',
       'Most people can be trusted, WVS round 1999-2004',
       'Most people can be trusted, WVS round 2005-2009',
       'Most people can be trusted, WVS round 2010-2014'],
      dtype='object')

Make a small version of hdf20, that has the same columns as hdf23

In [28]:
exclude = hdf20.columns.difference(hdf23.columns)
hdf20small = hdf20.drop(columns=exclude)
hdf20small.columns

Index(['Country name', 'year', 'Life Ladder', 'Log GDP per capita',
       'Social support', 'Healthy life expectancy at birth',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption', 'Positive affect', 'Negative affect'],
      dtype='object')

In [29]:
hdf20small.head()

,Country name,year,Life Ladder,Log GDP per capita,Social support,Healthy life expectancy at birth,Freedom to make life choices,Generosity,Perceptions of corruption,Positive affect,Negative affect
0,Afghanistan,2008,3.723590,7.144916,0.450662,50.799999,0.718114,0.178993,0.881686,0.517637,0.258195
1,Afghanistan,2009,4.401778,7.314788,0.552308,51.200001,0.678896,0.201228,0.850035,0.583926,0.237092
2,Afghanistan,2010,4.758381,7.421525,0.539075,51.599998,0.600127,0.131578,0.706766,0.618265,0.275324
3,Afghanistan,2011,3.831719,7.394349,0.521104,51.919998,0.495901,0.173452,0.731109,0.611387,0.267175
4,Afghanistan,2012,3.782938,7.480296,0.520637,52.240002,0.530935,0.246943,0.775620,0.710385,0.267919

In [30]:
hdf23.head()

,Country name,year,Life Ladder,Log GDP per capita,Social support,Healthy life expectancy at birth,Freedom to make life choices,Generosity,Perceptions of corruption,Positive affect,Negative affect
0,Afghanistan,2008,3.724,7.350,0.451,50.5,0.718,0.168,0.882,0.414,0.258
1,Afghanistan,2009,4.402,7.509,0.552,50.8,0.679,0.191,0.850,0.481,0.237
2,Afghanistan,2010,4.758,7.614,0.539,51.1,0.600,0.121,0.707,0.517,0.275
3,Afghanistan,2011,3.832,7.581,0.521,51.4,0.496,0.164,0.731,0.480,0.267
4,Afghanistan,2012,3.783,7.661,0.521,51.7,0.531,0.238,0.776,0.614,0.268

## Identify both datasets by year

In [34]:
hdf20small['year']

15

In [32]:
hdf23['year']=

### Append the datasets

In [33]:
hapdf =

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
hapdf.head()

In [ ]:
hapdf.tail()